In [2]:
import pandas as pd
import numpy as np
import mysql.connector

In [3]:
# load customer data
path = r'c:\Users\USER\Downloads\Customers (3).csv'
df_customers = pd.read_csv(path, encoding='latin1')
df_customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3/25/1936
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2/16/1992
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11/9/1937
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10/12/1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8/18/1965

In [4]:
df_customers['Birthday'] = pd.to_datetime(df_customers['Birthday'], errors='coerce').dt.date
df_customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,1965-08-18

In [5]:
# check data types
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [6]:
# checking for missing values
df_customers.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [7]:
print(df_customers.columns.tolist())

['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State', 'Zip Code', 'Country', 'Continent', 'Birthday']

In [8]:
df_customers.drop(['State Code', 'Zip Code'], axis=1, inplace=True)

In [9]:
df_customers

,CustomerKey,Gender,Name,City,State,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,South Australia,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,Western Australia,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,Victoria,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,South Australia,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,Victoria,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,Texas,United States,North America,1936-03-25
15262,2099618,Male,Justin Solórzano,Mclean,Virginia,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,North Carolina,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,California,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,Michigan,United States,North America,1965-08-18

In [10]:
# load exchange rate data
path = r'c:\Users\USER\Downloads\Exchange_Rates (2).csv'
df_exchange = pd.read_csv(path, encoding='latin1')
df_exchange

            Date Currency  Exchange
0       1/1/2015      USD    1.0000
1       1/1/2015      CAD    1.1583
2       1/1/2015      AUD    1.2214
3       1/1/2015      EUR    0.8237
4       1/1/2015      GBP    0.6415
...          ...      ...       ...
11210  2/20/2021      USD    1.0000
11211  2/20/2021      CAD    1.2610
11212  2/20/2021      AUD    1.2723
11213  2/20/2021      EUR    0.8238
11214  2/20/2021      GBP    0.7126

[11215 rows x 3 columns]

In [11]:
# rename the column
df_exchange.rename(columns={'Currency':'Currency Code'}, inplace=True)
df_exchange['Date'] = pd.to_datetime(df_exchange['Date'], errors='coerce').dt.date
df_exchange

             Date Currency Code  Exchange
0      2015-01-01           USD    1.0000
1      2015-01-01           CAD    1.1583
2      2015-01-01           AUD    1.2214
3      2015-01-01           EUR    0.8237
4      2015-01-01           GBP    0.6415
...           ...           ...       ...
11210  2021-02-20           USD    1.0000
11211  2021-02-20           CAD    1.2610
11212  2021-02-20           AUD    1.2723
11213  2021-02-20           EUR    0.8238
11214  2021-02-20           GBP    0.7126

[11215 rows x 3 columns]

In [12]:
df_exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           11215 non-null  object
 1   Currency Code  11215 non-null  object
 2   Exchange       11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [13]:
df_exchange.isnull().sum()

Date             0
Currency Code    0
Exchange         0
dtype: int64

In [14]:
# load product data
path = r'c:\Users\USER\Downloads\Products (3).csv'
df_products = pd.read_csv(path, encoding='latin1')
df_products

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [15]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [16]:
df_products.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [17]:
df_products['Unit Cost USD'] = (
    df_products['Unit Cost USD']
    .astype(str)  # convert to string first
    .str.replace('$', '', regex=False)
    .str.replace(',', '', regex=False)
    .astype(float)  # finally convert to float
)

df_products['Unit Price USD'] = (
    df_products['Unit Price USD']
    .astype(str)
    .str.replace('$', '', regex=False)
    .str.replace(',', '', regex=False)
    .astype(float)
)

In [18]:
df_products

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,1.71,3.35,505,Cell phones Accessories,5,Cell phones

In [19]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [20]:
print(df_products.columns.tolist())

['ProductKey', 'Product Name', 'Brand', 'Color', 'Unit Cost USD', 'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey', 'Category']

In [21]:
df_products.drop(['SubcategoryKey'], axis=1, inplace=True)

In [22]:
df_products

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,43.07,129.99,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,43.07,129.99,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,1.71,3.35,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,1.71,3.35,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,1.71,3.35,Cell phones Accessories,5,Cell phones

In [23]:
#load sales table
path = r'c:\Users\USER\Downloads\Sales (3).csv' 
df_sales = pd.read_csv(path, encoding='latin1')
df_sales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [24]:
df_sales.info

<bound method DataFrame.info of        Order Number  Line Item Order Date Delivery Date  CustomerKey  \
0            366000          1   1/1/2016           NaN       265598
1            366001          1   1/1/2016     1/13/2016      1269051
2            366001          2   1/1/2016     1/13/2016      1269051
3            366002          1   1/1/2016     1/12/2016       266019
4            366002          2   1/1/2016     1/12/2016       266019
...             ...        ...        ...           ...          ...
62879       2243030          1  2/20/2021           NaN      1216913
62880       2243031          1  2/20/2021     2/24/2021       511229
62881       2243032          1  2/20/2021     2/23/2021       331277
62882       2243032          2  2/20/2021     2/23/2021       331277
62883       2243032          3  2/20/2021     2/23/2021       331277

       StoreKey  ProductKey  Quantity Currency Code
0            10        1304         1           CAD
1             0        1048         2           USD
2             0        2007         1           USD
3             0        1106         7           CAD
4             0         373         1           CAD
...         ...         ...       ...           ...
62879        43         632         3           USD
62880         0          98         4           EUR
62881         0        1613         2           CAD
62882         0        1717         2           CAD
62883         0         464         7           CAD

[62884 rows x 9 columns]>

In [25]:
df_sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [26]:
df_sales['Order Date'] = pd.to_datetime(df_sales['Order Date'], errors='coerce').dt.date

In [27]:
df_sales['Delivery Date'] = df_sales['Delivery Date'].fillna(0)

In [28]:
df_sales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,0,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1/13/2016,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1/13/2016,1269051,0,2007,1,USD
3,366002,1,2016-01-01,1/12/2016,266019,0,1106,7,CAD
4,366002,2,2016-01-01,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,0,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2/23/2021,331277,0,464,7,CAD

In [29]:
df_sales.info

<bound method DataFrame.info of        Order Number  Line Item  Order Date Delivery Date  CustomerKey  \
0            366000          1  2016-01-01             0       265598
1            366001          1  2016-01-01     1/13/2016      1269051
2            366001          2  2016-01-01     1/13/2016      1269051
3            366002          1  2016-01-01     1/12/2016       266019
4            366002          2  2016-01-01     1/12/2016       266019
...             ...        ...         ...           ...          ...
62879       2243030          1  2021-02-20             0      1216913
62880       2243031          1  2021-02-20     2/24/2021       511229
62881       2243032          1  2021-02-20     2/23/2021       331277
62882       2243032          2  2021-02-20     2/23/2021       331277
62883       2243032          3  2021-02-20     2/23/2021       331277

       StoreKey  ProductKey  Quantity Currency Code
0            10        1304         1           CAD
1             0        1048         2           USD
2             0        2007         1           USD
3             0        1106         7           CAD
4             0         373         1           CAD
...         ...         ...       ...           ...
62879        43         632         3           USD
62880         0          98         4           EUR
62881         0        1613         2           CAD
62882         0        1717         2           CAD
62883         0         464         7           CAD

[62884 rows x 9 columns]>

In [30]:
# load store data
path = r'c:\Users\USER\Downloads\Stores (3).csv'
df_stores = pd.read_csv(path, encoding='latin1')
df_stores

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [31]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [32]:
df_stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [33]:
df_stores.fillna(0)

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,0.0,1/1/2010

In [34]:
df_stores['Open Date']=pd.to_datetime(df_stores['Open Date'], errors='coerce').dt.date

In [35]:
# replacing nan values
df_stores = df_stores.replace({np.nan:None})

In [36]:
df_stores

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09
...,...,...,...,...,...
62,63,United States,Utah,2000.0,2008-03-06
63,64,United States,Washington DC,1330.0,2010-01-01
64,65,United States,West Virginia,1785.0,2012-01-01
65,66,United States,Wyoming,840.0,2014-01-01
66,0,Online,Online,None,2010-01-01

In [37]:
df_stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

sql connection

In [38]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(
        host="gateway01.ap-southeast-1.prod.aws.tidbcloud.com",
        port=4000,
        user="3LwfumS4VReTvMP.root",
        password="MRapgCF8cOvWLabi",
        database="dataspark"
    )

    if connection.is_connected():
        
        cursor = connection.cursor()

        cursor.execute("SELECT DATABASE();")
        cursor.fetchall()

       
except Error as e:
    print(f" Error: {e}")

finally:
    #  Safe close
    if connection.is_connected():
        cursor.close()
        connection.close()

In [39]:
# customer table creation and data insertion
import mysql.connector
from mysql.connector import Error


try:
    # 1. Establish connection
    connection = mysql.connector.connect(
       host = "gateway01.ap-northeast-1.prod.aws.tidbcloud.com",
       port = 4000,
       user = "3a4M49L7Ack2pZS.root",
       password = "ZYuwgIk8h7AFcEaE",
       database = "dataspark"
    )

    if connection.is_connected():
        cursor = connection.cursor()

        # 2. Create table (with Continent)
        create_table_sql = '''
            CREATE TABLE IF NOT EXISTS Customer(
                CustomerID INT PRIMARY KEY,
                Gender VARCHAR(255),
                Name VARCHAR(255),
                City VARCHAR(255),
                State VARCHAR(255),
                Country VARCHAR(255),
                Continent VARCHAR(255),
                Birthday VARCHAR(255)
            )
        '''
        cursor.execute(create_table_sql)
        print("Customer_DETAILS table created successfully")

        # 3. Prepare insert query including Continent
        insert_sql = '''
            INSERT INTO Customer(
                CustomerID,
                Gender,
                Name,
                City,
                State,
                Country,
                Continent,
                Birthday
            ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
        '''

        # 4. Convert dataframe to list of tuples
        data_to_insert = list(df_customers.itertuples(index=False, name=None))

        # 5. Execute many and commit
        cursor.executemany(insert_sql, data_to_insert)
        connection.commit()
        print(f"{cursor.rowcount} records inserted successfully")

    else:
        print("Failed to connect to the database")

except Error as e:
    print(f"Error: {e}")

finally:
    # 6. Clean up: close cursor and connection if open
    if 'cursor' in locals() and cursor:
        cursor.close()
    if connection and connection.is_connected():
        connection.close()
        print("Connection closed")

Customer_DETAILS table created successfully
15266 records inserted successfully
Connection closed

In [40]:
# exchange table creation and data insertion
import mysql.connector
from mysql.connector import Error
try:
    # 1. Establish connection
    connection = mysql.connector.connect(
        host = "gateway01.ap-northeast-1.prod.aws.tidbcloud.com",
        port = 4000,
        user = "3a4M49L7Ack2pZS.root",
        password = "ZYuwgIk8h7AFcEaE",
        database = "dataspark"
    )
        

    if connection.is_connected():
        cursor = connection.cursor()

        # 2. Create table
        create_table_sql = ('''
            CREATE TABLE IF NOT EXISTS Exchange (
                DATE VARCHAR(255),
                Currency_Code VARCHAR(255),
                EXCHANGE FLOAT
            )
        ''')
        cursor.execute(create_table_sql)
        print("Exchange table created successfully")

        # 3. Prepare insert query
        insert_sql = ('''
            INSERT INTO Exchange (
                DATE,
                Currency_Code,
                EXCHANGE
            ) VALUES (%s, %s, %s)
        ''')

        # 4. Convert DataFrame to list of tuples
        data_to_insert = list(df_exchange.itertuples(index=False, name=None))

        # 5. Execute many and commit
        cursor.executemany(insert_sql, data_to_insert)
        connection.commit()
        print(f"{cursor.rowcount} records inserted successfully")

    else:
        print("Failed to connect to the database")

except Error as e:
    print(f"Error: {e}")

finally:
    # 6. Clean up: close cursor and connection if open
    if 'cursor' in locals() and cursor:
        cursor.close()
    if connection and connection.is_connected():
        connection.close()
        print("Connection closed")

Exchange table created successfully
11215 records inserted successfully
Connection closed

In [41]:
print(df_products.columns.tolist())

['ProductKey', 'Product Name', 'Brand', 'Color', 'Unit Cost USD', 'Unit Price USD', 'Subcategory', 'CategoryKey', 'Category']

In [42]:
# product table creation and data insertion
import mysql.connector
from mysql.connector import Error
import pandas as pd


try:
    # 1. Rename DataFrame columns to match SQL schema
    df_products = df_products.rename(columns={
        'Product Name': 'Product_Name',
        'Unit Cost USD': 'Unit_Cost_USD',
        'Unit Price USD': 'Unit_Price_USD'
    })

    # 2. Convert numeric columns and handle invalid values
    df_products['Unit_Cost_USD'] = pd.to_numeric(df_products['Unit_Cost_USD'], errors='coerce')
    df_products['Unit_Price_USD'] = pd.to_numeric(df_products['Unit_Price_USD'], errors='coerce')

    # 3. Drop rows where the price column is invalid (NaN) so insertion succeeds
    df_products = df_products.dropna(subset=['Unit_Price_USD'])

    # 4. Establish database connection
    connection = mysql.connector.connect(
         host = "gateway01.ap-northeast-1.prod.aws.tidbcloud.com",
        port = 4000,
        user = "3a4M49L7Ack2pZS.root",
        password = "ZYuwgIk8h7AFcEaE",
        database = "dataspark"
    )
        

       

    if connection.is_connected():
        cursor = connection.cursor()

        # 5. Create the Products table (if it doesn’t already exist)
        create_table_sql = '''
            CREATE TABLE IF NOT EXISTS Products (
                ProductKey INT,
                Product_Name VARCHAR(255),
                Brand VARCHAR(255),
                Color VARCHAR(255),
                Category VARCHAR(255),
                Unit_Cost_USD FLOAT,
                Unit_Price_USD FLOAT,
                Subcategory VARCHAR(255),
                CategoryKey VARCHAR(255)
            )
        '''
        cursor.execute(create_table_sql)
        print("Products table created successfully")

        # 6. Prepare the INSERT query
        insert_sql = '''
            INSERT INTO Products (
                ProductKey,
                Product_Name,
                Brand,
                Color,
                Category,
                Unit_Cost_USD,
                Unit_Price_USD,
                Subcategory,
                CategoryKey
            ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
        '''

        # 7. Convert DataFrame to list of tuples, in the correct column order
        data_to_insert = list(
            df_products[
                ['ProductKey', 'Product_Name', 'Brand', 'Color', 'Category',
                 'Unit_Cost_USD', 'Unit_Price_USD', 'Subcategory', 'CategoryKey']
            ].itertuples(index=False, name=None)
        )

        # 8. Execute batch insertion and commit the transaction
        cursor.executemany(insert_sql, data_to_insert)
        connection.commit()
        print(f"{cursor.rowcount} records inserted successfully")

    else:
        print("Failed to connect to the database")

except Error as e:
    print(f"Error: {e}")

finally:
    # 9. Clean up resources (cursor + connection)
    if 'cursor' in locals() and cursor:
        cursor.close()
    if connection and connection.is_connected():
        connection.close()
        print("Connection closed")

Products table created successfully
2517 records inserted successfully
Connection closed

In [45]:
# sales table creation and data insertion
import mysql.connector
from mysql.connector import Error
import re

try:
    connection = mysql.connector.connect(
      host = "gateway01.ap-northeast-1.prod.aws.tidbcloud.com",
      port = 4000,
      user = "3a4M49L7Ack2pZS.root",
      password = "ZYuwgIk8h7AFcEaE",
      database = "dataspark"
)

    if connection.is_connected():
        cursor = connection.cursor()
        print("✅ Connected to MySQL")

        # 1️⃣ Create table with 9 columns (including StoreKey)
        create_table_sql = '''
            CREATE TABLE IF NOT EXISTS Sales (
                Order_Number INT,
                Line_Item INT,
                Order_Date VARCHAR(255),
                Delivery_Date VARCHAR(255),
                CustomerKey INT,
                StoreKey INT,
                ProductKey INT,
                Quantity INT,
                Currency_Code VARCHAR(255)
            )
        '''
        cursor.execute(create_table_sql)
        print("✅ Sales table (9 columns) ready")

        # 2️⃣ Clean and normalize columns automatically
        print("\nOriginal columns in df_sales:", df_sales.columns.tolist())

        def clean_column(col):
            col = col.strip()
            col = col.replace(" ", "_")
            col = re.sub(r"[^A-Za-z0-9_]", "", col)
            return col

        df_sales.columns = [clean_column(c) for c in df_sales.columns]
        print("🧹 Cleaned columns:", df_sales.columns.tolist())

        # 3️⃣ Expected 9 columns
        expected_cols = [
            'Order_Number', 'Line_Item', 'Order_Date', 'Delivery_Date',
            'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency_Code'
        ]

        # 4️⃣ Auto-match similar names
        mapping = {}
        for col in df_sales.columns:
            for target in expected_cols:
                if col.lower().replace("_", "") == target.lower().replace("_", ""):
                    mapping[col] = target
                    break

        df_sales = df_sales.rename(columns=mapping)
        missing = [col for col in expected_cols if col not in df_sales.columns]
        if missing:
            raise KeyError(f"Missing expected columns in DataFrame: {missing}")

        df_sales = df_sales[expected_cols]
        print("✅ Final column order:", df_sales.columns.tolist())

        # 5️⃣ Insert into MySQL
        insert_sql = '''
            INSERT INTO Sales (
                Order_Number, Line_Item, Order_Date, Delivery_Date,
                CustomerKey, StoreKey, ProductKey, Quantity, Currency_Code
            ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
        '''

        data_to_insert = [tuple(row) for row in df_sales.to_numpy()]
        print(f"\n📦 Ready to insert {len(data_to_insert)} records...")

        if len(data_to_insert) > 0:
            cursor.executemany(insert_sql, data_to_insert)
            connection.commit()
            print(f"✅ {cursor.rowcount} Sales records inserted successfully")
        else:
            print("⚠️ No records found in df_sales to insert")

        # 6️⃣ Verify total rows
        cursor.execute("SELECT COUNT(*) FROM Sales")
        total_rows = cursor.fetchone()[0]
        print("📊 Total rows in Sales table:", total_rows)

except Error as e:
    print(f"⚠️ Database Error: {e}")

except KeyError as e:
    print(f"⚠️ Column Error: {e}")

finally:
    if 'cursor' in locals() and cursor:
        cursor.close()
    if connection and connection.is_connected():
        connection.close()
        print("🔒 Connection closed")

✅ Connected to MySQL
✅ Sales table (9 columns) ready

Original columns in df_sales: ['Order_Number', 'Line_Item', 'Order_Date', 'Delivery_Date', 'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency_Code']
🧹 Cleaned columns: ['Order_Number', 'Line_Item', 'Order_Date', 'Delivery_Date', 'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency_Code']
✅ Final column order: ['Order_Number', 'Line_Item', 'Order_Date', 'Delivery_Date', 'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency_Code']

📦 Ready to insert 62884 records...
✅ 62884 Sales records inserted successfully
📊 Total rows in Sales table: 62884
🔒 Connection closed

In [46]:
# store table creation and data insertion
import mysql.connector
from mysql.connector import Error
try:
    # 1. Establish connection
    connection = mysql.connector.connect(
       host = "gateway01.ap-northeast-1.prod.aws.tidbcloud.com",
       port = 4000,
       user = "3a4M49L7Ack2pZS.root",
       password = "ZYuwgIk8h7AFcEaE",
       database = "dataspark"
    )

    if connection.is_connected():
        cursor = connection.cursor()

        # 2. Create table
        create_table_sql = ('''
            CREATE TABLE IF NOT EXISTS Stores (
                StoreKey INT,
                Country VARCHAR(255),
                State VARCHAR(255),
                Square_Metres VARCHAR(255),
                Open_Date VARCHAR(255)
            )                                    
        ''')
        cursor.execute(create_table_sql)
        print("Stores table created successfully")

        # 3. Prepare insert query
        insert_sql = ('''
            INSERT INTO Stores (
                StoreKey,
                Country,
                State,
                Square_Metres,
                Open_Date
            ) VALUES (%s, %s, %s, %s, %s)
        ''')

        # 4. Convert DataFrame to list of tuples
        data_to_insert = list(df_stores.itertuples(index=False, name=None))

        # 5. Execute many and commit
        cursor.executemany(insert_sql, data_to_insert)
        connection.commit()
        print(f"{cursor.rowcount} records inserted successfully")

    else:
        print("Failed to connect to the database")

except Error as e:
    print(f"Error: {e}")

finally:
    # 6. Clean up: close cursor and connection if open
    if 'cursor' in locals() and cursor:
        cursor.close()
    if connection and connection.is_connected():
        connection.close()
        print("Connection closed")

Stores table created successfully
67 records inserted successfully
Connection closed